MISC/2023-04-12.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-12 水 18:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>タイトルとヘッダーが重なってしまう他修正</title>
<meta name="author" content="和田勇" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">タイトルとヘッダーが重なってしまう他修正</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org42a98dc">1. 作曲家毎の変更・追加状況</a></li>
</ul>
</div>
</div>

<div id="outline-container-org42a98dc" class="outline-2">
<h2 id="org42a98dc"><span class="section-number-2">1.</span> 作曲家毎の変更・追加状況</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><p>
提供していただいたステータス情報をまとめると &#x2026;
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Brahms</td>
<td class="org-left">phase-2</td>
<td class="org-left">Brahms.tex</td>
<td class="org-left">Op.103 などの追加有り</td>
</tr>

<tr>
<td class="org-left">Schubert</td>
<td class="org-left">phase-1</td>
<td class="org-left">Schubert.tex</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Schumann</td>
<td class="org-left">phase-2</td>
<td class="org-left">Schumann.tex</td>
<td class="org-left">S1162.htm.tex</td>
</tr>

<tr>
<td class="org-left">Strauss</td>
<td class="org-left">master</td>
<td class="org-left">Strauss.tex</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Wolf</td>
<td class="org-left">phase-1</td>
<td class="org-left">Wolf.tex</td>
<td class="org-left">S500.htm.tex</td>
</tr>
</tbody>
</table></li>

<li>上記から以下の手順で今回の修正を取り込むことにする

<ol class="org-ol">
<li><p>
lyricssongs/EDIT のバックアップ作成
</p>
<pre class="example">
Copy-Item EDIT 2023-04-XX-EDIT -Force -Recurse
</pre></li>
<li><p>
lyricssongs/EDIT 以下をとりあえず暫定コミット&amp;ブランチを phase-3 &amp; 微調整
</p>

<p>
<b>警告メッセージ多数でるが無視して良い</b>
</p>

<pre class="example">
Remove-Item EDIT/Brahms/Brahms.fls -Force
Remove-Item EDIT/Brahms/Brahms.log -Force
$repo = "Brahms", "Schubert", "Schumann", "Strauss", "Wolf"
foreach ( $d in $repo ) {
   if ( Test-Path EDIT/$d ) {
       git -C EDIT/$d add .                                           --quiet
       git -C EDIT/$d commit -am "auto commit"                        --quiet
       git -C EDIT/$d branch -m master main                           --quiet
       git -C EDIT/$d checkout main                                   --quiet
       git -C EDIT/$d checkout -b phase-3                             --quiet
       git -C EDIT/$d branch -D phase-1                               --quiet
       git -C EDIT/$d branch -D phase-2                               --quiet
       git -C EDIT/$d config --local core.autocrlf false              --quiet
       git -C EDIT/$d config --local user.name  "anonymous anonymous" --quiet
       git -C EDIT/$d config --local user.email "anonymous@anonymous" --quiet
   }
}
</pre></li>
<li><p>
github から fetch &amp; pull
</p>
<pre class="example">
# Windows とそれ以外の OS で共同作業をするため
git config --local core.autocrlf false --quiet

git fetch
git pull
</pre></li>
<li><p>
sty ファイルを EDIT にコピーし git 管理できるようにする
</p>
<pre class="example">
Copy-Item sty EDIT  -Force -Recurse

# 以下は EDIT/sty で変更有無を容易に把握するため
git config --global init.defaultBranch main
git -C EDIT/sty init .
git -C EDIT/sty config --local core.autocrlf false --quiet
git -C EDIT/sty config --local user.name  "anonymous anonymous"
git -C EDIT/sty config --local user.email "anonymous@anonymous"
git -C EDIT/sty add .
git -C EDIT/sty commit -am .
</pre></li>
<li><p>
lyricssongs の Brahms Schubert Schumann Strauss Wolf を削除
</p>
<pre class="example">
Remove-Item Brahms   -Force -Recurse
Remove-Item Schubert -Force -Recurse
Remove-Item Schumann -Force -Recurse
Remove-Item Straus   -Force -Recurse
Remove-Item Wolf     -Force -Recurse
</pre></li>
<li><p>
lyricssongs で Brahms Schubert Schumann Strauss Wolf を再作成
</p>
<div class="org-src-container">
<pre class="src src-bash">ruby scripts/21-lyricssongs-tex-gen.rb COMP/*.htm
</pre>
</div></li>
<li><p>
出来上がった Brahms Schubert Schumann Strauss Wolf を EDIT に重ね書き
</p>
<pre class="example">
$repo = "Brahms", "Schubert", "Schumann", "Strauss", "Wolf"
foreach ( $d in $repo) {
   if (Test-Path $d){
      $ff = Get-ChildItem $d '*.tex' -File
      foreach ($f in $ff) {
         Copy-Item $f.FullName EDIT/$d/$f
      }
   }
}
</pre></li>
<li>EDIT のバックアップから必要なものをコピー
<ul class="org-ul">
<li>[作業不要] Brahms-section-Op.103.tex</li>
<li>[作業不要] Brahms-subsection-Op.103-1.tex</li>
<li>[作業不要] Brahms-subsection-Op.103-2.tex</li>
<li>[作業不要] Brahms-subsection-Op.103-3.tex</li>
<li>[作業不要] Brahms-subsection-Op.103-4.tex</li>
<li>[作業不要] Brahms-subsection-Op.103-5.tex</li>
<li>[作業不要] Brahms-subsection-Op.103-6.tex</li>
<li>[作業不要] Brahms-subsection-Op.103-7.tex</li>
<li>[作業不要] Brahms-subsection-Op.103-8.tex</li>
<li>[作業不要] Brahms-subsection-Op.14-8.tex</li>
<li class="off"><code>[&#xa0;]</code> <p>
Schumann/S1162.htm.tex
</p>
<pre class="example">
git -C EDIT/Schumann checkout S1162.htm.tex
</pre></li>
<li class="off"><code>[&#xa0;]</code> <p>
Wolf/S500.htm.tex
</p>
<pre class="example">
git -C EDIT/Wolf checkout S500.htm.tex
</pre></li>
</ul></li>

<li>EDIT/Brahms の以下のファイルを修正
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Brahms.tex
<ul class="org-ul">
<li><p>
97 行目になるよう Brahms-section-Op.103.tex を挿入
</p>
<pre class="example">
96-\input{Brahms/Brahms-section-31.tex}
97:\input{Brahms/Brahms-section-Op.103.tex}
98-\input{Brahms/Brahms-section-32.tex}
</pre></li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Brahms-hyper-link.tex
<ul class="org-ul">
<li><p>
97 行目になるよう Brahms-section-Op.103.tex を挿入
</p>
<pre class="example">
96-\input{Brahms/Brahms-section-31.tex}
97:\input{Brahms/Brahms-section-Op.103.tex}
98-\input{Brahms/Brahms-section-32.tex}
</pre></li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Brahms-section-03.tex
<ul class="org-ul">
<li><p>
以下を一番最後に追加する
</p>
<pre class="example">
\input{Brahms/Brahms-subsection-Op.14-8.tex}
</pre></li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Brahms-section-Op.103.tex
<ul class="org-ul">
<li><p>
9 行目になるよう \newpage を挿入
</p>
<pre class="example">
1:\SECTION%
2:{He Zigeuner}% タイトル（原）
3:{H-He Zigeuner}% よみ情報（原）
4:{さあ、ジプシーよ }% タイトル（訳）
5:{さ-さあじふしーよ }% よみ情報（訳）
6:{Op.103}% 整理番号
7:{(1887)}% その他情報（原）
8:{}% その他情報（訳）
9:\bewpage
</pre></li>
<li><p>
文字コード化対応
</p>
<pre class="example">
nkf --overwrite -w -Lu .\EDIT\Brahms\Brahms-section-Op.103.tex
</pre></li>
</ul></li>
</ul></li>
<li>llmk でタイプセットできるか確認</li>
<li><p>
タイプセットが一通り問題なく終わったら、EDIT の Brahms Schubert
Schumann Strauss で変更したものを登録
</p>

<p>
以下は Brahms の例なので Schubert Schumann Strauss Wolf それぞれで同じ作業を行う。
</p>
<pre class="example">
$repo = "Brahms", "Schubert", "Schumann", "Strauss", "Wolf"
foreach ( $d in $repo ) {
   if ( Test-Path EDIT/$d ) {
       git -C EDIT/$d commit -am "auto commit(phase-3)" --quiet
       git -C EDIT/$d checkout main                     --quiet
       git -C EDIT/$d checkout -b phase-4               --quiet
       git -C EDIT/$d branch -D phase-3                 --quiet
   }
}
</pre></li>
</ol></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 和田勇</p>
<p class="date">Created: 2023-04-12 水 18:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>